<a href="https://colab.research.google.com/github/SteEcker/Kaggle/blob/main/titanic/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 2022-01-27 - Titanic

Workspace Setup

In [6]:
! git clone https://github.com/SteEcker/Kaggle.git

%cd /content/Kaggle/titanic

%ls

Cloning into 'Kaggle'...
remote: Enumerating objects: 34, done.
remote: Counting objects: 100% (34/34), done.
remote: Compressing objects: 100% (26/26), done.
remote: Total 34 (delta 11), reused 16 (delta 3), pack-reused 0
Unpacking objects: 100% (34/34), done.
/content/Kaggle/titanic
gender_submission.csv  test.csv  titanic.ipynb  train.csv

In [36]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

import os
for dirname, _, filenames in os.walk('.'):
    for filename in filenames:
        print(os.path.join(dirname, filename))
# activate R magic
%load_ext rpy2.ipython

./gender_submission.csv
./titanic.ipynb
./test.csv
./train.csv
The rpy2.ipython extension is already loaded. To reload it, use:
  %reload_ext rpy2.ipython

In [14]:
# Read datasets
train = pd.read_csv('train.csv')
print(f"Shape of train data {train.shape}.")
train.head()

Shape of train data (891, 12).

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Basic Indexing

In [18]:
# Access specific series in a data frame
train.Survived
# or equivalent
train["Survived"]
# Select first 10 values
train["Survived"][0:10]

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

Select the first row of data in a DataFrame,

In [19]:
train.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object


Select first column

In [21]:
train.iloc[:, 0]

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

Or by using column names

In [23]:
train.loc[:, ['Survived', 'Name']]

     Survived                                               Name
0           0                            Braund, Mr. Owen Harris
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1                             Heikkinen, Miss. Laina
3           1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0                           Allen, Mr. William Henry
..        ...                                                ...
886         0                              Montvila, Rev. Juozas
887         1                       Graham, Miss. Margaret Edith
888         0           Johnston, Miss. Catherine Helen "Carrie"
889         1                              Behr, Mr. Karl Howell
890         0                                Dooley, Mr. Patrick

[891 rows x 2 columns]

Filter Columns

In [28]:
train.loc[train.Survived == 1]
train.loc[(train.Survived == 1) & (train.Pclass == 3)]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
2              3         1       3  ...   7.9250   NaN         S
8              9         1       3  ...  11.1333   NaN         S
10            11         1       3  ...  16.7000    G6         S
19            20         1       3  ...   7.2250   NaN         C
22            23         1       3  ...   8.0292   NaN         Q
..           ...       ...     ...  ...      ...   ...       ...
838          839         1       3  ...  56.4958   NaN         S
855          856         1       3  ...   9.3500   NaN         S
858          859         1       3  ...  19.2583   NaN         C
869          870         1       3  ...  11.1333   NaN         S
875          876         1       3  ...   7.2250   NaN         C

[119 rows x 12 columns]

Filter NAs

In [31]:
train.loc[train.Cabin.notnull()]
train.loc[train.Cabin.isnull()]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
2              3         1       3  ...   7.9250   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[687 rows x 12 columns]

In [35]:
%%R
library("dplyr")

R[write to console]:
Attaching package: ‘dplyr’


R[write to console]: The following objects are masked from ‘package:stats’:

    filter, lag


R[write to console]: The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union